<?php
$params['owner_id'] = '-76820816';
$params['form_group'] = 1;
$params['message'] = '
#Гороскоп для всех знаков зодиака на 2 декабря 2014 года.

#ОВЕН
"В первой половине декабря уделите больше внимания карьере, достижению своих целей. Удача сейчас на вашей стороне. Вторая половина месяца сулит больше общения с друзьями. Отношения с ними станут более теплыми, гармоничными. Новый год можно встретить в их компании, тогда яркие впечатления и новые интересные знакомства вам обеспечены. Не забывайте о важности отдыха. Энергии сейчас может не хватать, поэтому время от времени позволяйте себе расслабиться и побыть в одиночестве, наедине со своими мыслями. 

#ТЕЛЕЦ
Обстановка интересна, но для большинства Рыб некомфортна. Одно и то же происшествие вызовет гамму противоречивых чувств. Тем не менее в любом повороте событий найдется позитивный момент, прямо способствующий исполнению ваших желаний. Не выбирайте этот день для спокойного отдыха, будет много будоражащих моментов. Возможны непредвиденные приобретения и траты, приводящие к смене финансовой или деловой политики. С практической реализацией идей не исключены проблемы, но не запрещаются первые пробы пера. 

#БЛИЗНЕЦЫ
Ваше положение не отличается стабильностью, перемены возможны каждую минуту. Примите во внимание этот факт и позаботьтесь о подстраховке на случай непредвиденных проблем. Роль спасательного круга для Рыб могут выполнить надежные люди, финансовые резервы, какие-либо запасы, дополнительная территория. Постарайтесь найти равновесие между своими основными привычками и требованиями момента, которым вы вынуждены подчиняться. Не витайте в облаках, интуитивные решения обязательно сверяйте с действительностью. 

#РАК
День требует от Рыб глубинного взгляда на происходящее. Поверхностный подход ничего не даст. Если вы недовольны зарплатой, повседневным окружением или другими аспектами жизни, ищите коренные причины проблем. Это не лучший день для активных поисков информации. Советы не удовлетворят вас, или советчики окажутся недоступны. Положитесь на опыт и здравый смысл. Не стоит также производить слишком резкие перемены в привычных делах, экспериментировать со сценариями общения или с порядком денежных операций. 

#ЛЕВ
Если хотите преуспеть, настройтесь на интенсивный график, усиление нагрузок в обозримом будущем. Становитесь общительнее, демократичнее. Позаботьтесь о подвижности и оперативности. Возможно, пора сесть за руль, сменить средства связи. Откажитесь от разборчивости, откройтесь веяниям моды и прогресса. Сейчас можно пополнять знания, расширять круг контактов и область интересов. Систематизацией и отсевом займетесь позже. У многих Рыб назревшие преобразования коснутся домашнего уклада, семейных отношений. 

#ДЕВА
Сегодня внимание может притянуть домашняя обстановка. Хорошо принимать гостей, обсуждать семейные и другие новости в кругу родственников. Можно приступить к планам на праздничный период, заняться составлением и рассылкой писем, открыток, приглашений. Важные сутки для Рыб, имеющих личный сайт или желающих примкнуть к сообществу. Помните, что не все сюжеты этого дня однозначны. Кое-что будет плодом вашей фантазии. Не исключено, что вы будете втянуты в тонкую игру или сами создадите для нее предпосылки. 

#ВЕСЫ
Утром Рыбам придется считаться с обстановкой. Сыграют роль текущие условия, например, бытовые или информационные. Ваши и чужие вкусы будут непостоянными, не исключены капризы, лень. При появлении разногласий пойдите сами навстречу окружающим, особенно если это близкие и дорогие вам люди. Сбалансированные отношения доставят много радости, отсутствие баланса может спровоцировать хаос. В конце дня гармония появится сама собой в силу обстоятельств либо вы будете находить нужный тон в общении интуитивно. 

#СКОРПИОН
Традиционные планы и ценности, уважаемые Рыбами, могут отойти на второй план, а в фокусе внимания окажутся новые необычные варианты. Не исключена эмоциональная экзальтация, склонность к преувеличениям. Чтобы не разбрасываться ресурсами и возможностями, руководствуйтесь требованиями момента и перспективами на ближайшие полгода. Свои таланты раскрывайте с неожиданной стороны, в актуальном на данный момент режиме и стиле. Не отказывайтесь от приглашения в гости, особенно если зовут сослуживцы, начальство. 

#СТРЕЛЕЦ
Рыбы могут оказаться на распутье. Азарт, характерный для первой половины дня, к вечеру иссякнет или ослабеет. Может также закончиться полоса везения в том направлении, которое вас привлекает. Вы поймете, что заманчивых целей трудно добиться при помощи одного лишь вдохновения, необходимо пересмотреть планы и кое-что изменить. Возможно, вам надо улучшить физическую форму или заново отработать профессиональные навыки. Ложитесь спать пораньше, чтобы на следующий день с новыми силами взяться за работу. 

#КОЗЕРОГ
Не стройте твердых планов, готовьтесь действовать по обстановке. Если вам дорого время, некоторые договоренности придется пересматривать буквально на ходу. Многим Рыбам будет трудно подстроиться под быстрый ритм событий. Кто-то из друзей или коллег может повести себя не так, как обычно. Это не лучший день для деловых операций, поспешная сделка может дать не тот эффект, на который вы рассчитывали. Можно внести изменения там, где в этом давно назрела необходимость, но ранее не было подходящих условий. 

#ВОДОЛЕЙ
Сегодня для Рыб важны оперативность и целеустремленность. Не отвлекайтесь на посторонние темы, сконцентрируйтесь на одном или двух магистральных направлениях, тогда вы все успеете. Подключайте к решению своих проблем друзей, коллег, знакомых. Чем больше полезных деловых контактов, тем быстрее вы уладите все вопросы. В центре внимания могут оказаться планы, связанные с учебой, поездками, командировками, оплатой различных услуг, оформлением бумаг. Полученную информацию пускайте в дело незамедлительно. 

#РЫБЫ
Если ваша цель — завести друзей, не теряйте времени. Сегодня будет несложно понравиться коллегам или шефу, найти новых знакомых в реале или в виртуальном пространстве. Поводом для сближения могут стать последние новости, интересы в области моды, рекламы, искусства, программирования. В то же время не стройте воздушных замков, возможности Рыб в этой сфере могут быть ограничены их же придирчивостью и строгостью. Не исключено, что многообещающие отношения так и останутся поверхностными, приятельскими. 

http//astrostar.ru/horoscopes/
';
$params['version'] = '5.27';
$params['attachments'] = ',http://atrostar.ru/horoscopes';
$ch = curl_init( 'https://api.vk.com/method/wall.post?access_token=3de25804416198d280104bcad9ff86b43fa92d2e54fc199620687a4d3cb32dd4d49961faa2df4643f16d9');
curl_setopt ( $ch, CURLOPT_HEADER, false );
curl_setopt ( $ch, CURLOPT_RETURNTRANSFER, true );
curl_setopt ( $ch, CURLOPT_SSL_VERIFYPEER, false );
curl_setopt ( $ch, CURLOPT_POST, true );
curl_setopt ( $ch, CURLOPT_POSTFIELDS, $params );
$data = json_decode(curl_exec($ch));
curl_close($ch);
print_r($data);